app/Models/UserModel.php

    public function getAllofUsers(){
        return $this->withDeleted()->findAll();
---
SELECT *
FROM `users`

    public function getUserbyUsername($username){
        return $this->where('username', $username)
                    ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `users`.`deleted_at` IS NULL
 LIMIT 1